app/controllers/google_controller.rb

SELECT "tokens".* FROM "tokens" WHERE (expires_at < CURRENT_TIMESTAMP) ORDER BY "tokens"."id" DESC LIMIT 1
---
  def connect
  	@last_token = Token.last