app/controllers/sessions_controller.rb

INSERT INTO "tokens" ("created_at", "expires_at", "refresh_token", "token", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create

    @auth = request.env["omniauth.auth"]["credentials"]

@auth.inspect
     Token.create(
      email:          @auth['email'],
      token:          @auth['token'],
      refresh_token:  @auth['refresh_token'],
      expires_at:     @auth['expires_at'])